{
    "Home": [
        {
            "title": "Odd discoloration and crack in basement floor",
            "selftext": "I'm buying a new home built in 2004 and I noticed as I was rewatching the video there's this big spot in the basement. It kind of looks like it was a repair job of some sort. this a call concern? My inspection is on Wednesday.",
            "url": "https://i.redd.it/am5o1grr2qyd1.jpeg"
        },
        {
            "title": "What is this?  ",
            "selftext": "Saw this at a house my sister in law was looking at and saw something similar at another house.   Is it just to shore up the walls?   Was this a common practice?   The houses were both pretty old.   ",
            "url": "https://i.redd.it/ucfyoiedbjyd1.jpeg"
        },
        {
            "title": "What’s one home improvement project that gave you the best value for your money?\n",
            "selftext": "",
            "url": "https://www.reddit.com/r/Home/comments/1gis8db/whats_one_home_improvement_project_that_gave_you/"
        },
        {
            "title": "Protective film on stainless steel?",
            "selftext": "Am I supposed to remove this film from my stainless steel refrigerator? ",
            "url": "https://i.redd.it/t9lbg19y9pyd1.jpeg"
        },
        {
            "title": "Should I buy a House that has water seapage in basement?",
            "selftext": "There is a house that checks all of the boxes, with both the house and property being exactly what I am looking for at a reasonable price. The home was built in 1930. The only issue I noticed when seeing the house is the basement. Once I went downstairs, you can tell a musty type smell like higher humidity. They do have a dehumidifier going as well. There were two main floor joists on the ceiling, and they where being held up/given extra support by floor jacks, going directly from the cement floor to the joists above. There were about 6 floor jacks for each joists. I did see a sump pit with a pump on the floor. Otherwise not too much else, did notice any standing water or anything while I was in there. I asked my agent about the disclosure form and the sellers did put that \"the basement has water seapage on the floor during heavy rainfall\". \nIs this house worth continuing with an offer etc? I know an older home like this won't be perfect, and it's a larger property that's hard to find for it's price. But I don't want to get myself into a mess.",
            "url": "https://www.reddit.com/r/Home/comments/1gio3oz/should_i_buy_a_house_that_has_water_seapage_in/"
        }
    ],
    "AskReddit": [
        {
            "title": "What are the NSFW subs you follow?",
            "selftext": "",
            "url": "https://www.reddit.com/r/AskReddit/comments/1gipm98/what_are_the_nsfw_subs_you_follow/"
        },
        {
            "title": "What is one \"never have, never will\" thing for you?",
            "selftext": "",
            "url": "https://www.reddit.com/r/AskReddit/comments/1gika69/what_is_one_never_have_never_will_thing_for_you/"
        },
        {
            "title": "What's something all guys do but never admit to?",
            "selftext": "",
            "url": "https://www.reddit.com/r/AskReddit/comments/1gingnm/whats_something_all_guys_do_but_never_admit_to/"
        }
    ],
    "NoStupidQuestions": [
        {
            "title": "How did babies and mothers survive birth in caveman times?",
            "selftext": "I’ve wondered this for decades and figured what the hell might as well ask. So the baby is born how do they cut the umbilical cord?  Smash it with a rock?  How do the moms survive?  I was with my wife for all three of our kids births in a modern hospital and I was still stressed that she was going to have issues. As it was our second kid had a clogged airway and was whisked away to NICU for 24 hours. She had stopped breathing and hard turned blue. They couldn’t remove the fluid in her airways.  \n\nThanks in advance. ",
            "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1ginzit/how_did_babies_and_mothers_survive_birth_in/"
        },
        {
            "title": "If you had twins during day light savings and one was born at 1:58am, then the time changed back to 1:00 am before giving birth to the second baby, which baby would be older? Because technically it would be baby A but on paper it would be baby B.   Anyway it’s 1am and I can’t sleep.",
            "selftext": "Can’t edit title I forgot to take out the 1am part. ",
            "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1gioy3d/if_you_had_twins_during_day_light_savings_and_one/"
        },
        {
            "title": "is it still dry humping if you're underwater",
            "selftext": "title",
            "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1girii4/is_it_still_dry_humping_if_youre_underwater/"
        },
        {
            "title": "If all the chemicals in cigarettes are so unhealthy why don’t cigarettes just have straight tabacco? ",
            "selftext": "",
            "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1gib982/if_all_the_chemicals_in_cigarettes_are_so/"
        }
    ],
    "BaldursGate3": [
        {
            "title": "Finally got my Shadowheart tattoo and I'm legit mc lovin' it",
            "selftext": "I really wanted my 1st tattoo to be something meaningful to me, and I literally cannot express how much this game helped me during a very difficult time period in my life.\n\nLong story short I was hospitalized for like 2 months, and the only thing putting a smile on my face (other than my mom) everyday was playing BG3 and especially Shadowheart's romance. \n\nMy artist did an incredible job at altering my design and the end product is simply amazing, and I thought to share this big moment with you guys! Have a great day! 🤟🔥",
            "url": "https://www.reddit.com/gallery/1gingzj"
        },
        {
            "title": "For all the fellow Shadowheart enthusiats out there",
            "selftext": "",
            "url": "https://i.redd.it/x0nbvfme6qyd1.jpeg"
        },
        {
            "title": "What’s the most out of pocket banter you've heard?",
            "selftext": "I just heard Minthara and Gale have the most out of pocket banter and I’m cackling. Like I’ve heard my companions say some wild stuff but this really caught me off guard!\n\n> Gale: I found an empty bottle of venom in camp, Minthara. Safe to assume it was yours?\n>\n> Minthara: Indeed. I have been dosing my partner while they sleep by my side.\n>\n> Minthara: They refuse to take it in their food, but I must build up their immunity in case we ever visit Menzoberranzan together.\n>\n> Gale: Let's never speak of this again.\n\nLike HOW do the writers come up with this stuff 😂😂 \n\nThere was also an absolutely hilarious dialogue option I had the other day. When you get to the brothel and meet the Drow twins you can tell Sorn Orlith that you want boring missionary sex (which he's super into btw lmao) and you get the dialogue option \"if I wanted boring sex I could just ask Gale\" like WOW, we just took Gale out back and murdered him. \n\nThis game is full of absolutely hilarious and chaotic lines, let me hear your favorites! ",
            "url": "https://www.reddit.com/r/BaldursGate3/comments/1giorai/whats_the_most_out_of_pocket_banter_youve_heard/"
        }
    ],
    "facepalm": [
        {
            "title": "ohio, ladies and gents",
            "selftext": "",
            "url": "https://i.redd.it/1mjiibagzpyd1.jpeg"
        },
        {
            "title": "Someone is gonna lose his balls soon.",
            "selftext": "",
            "url": "https://i.redd.it/9qxt81ra8pyd1.png"
        },
        {
            "title": "Make America Trashy Again",
            "selftext": "",
            "url": "https://i.redd.it/dw3qdxjzznyd1.jpeg"
        },
        {
            "title": "You don't need to defend them",
            "selftext": "",
            "url": "https://i.redd.it/tjq9sqae1nyd1.jpeg"
        },
        {
            "title": "The A Team 😬",
            "selftext": "",
            "url": "https://i.redd.it/s99gbhb8royd1.png"
        }
    ],
    "interestingasfuck": [
        {
            "title": "In Iran, a woman who was accosted by the “morality police” for not wearing hijab removes her clothing & roams the streets in defiance. She has since been arrested by IRGC forces and forcibly disappeared.",
            "selftext": "",
            "url": "https://v.redd.it/cbjlroyxooyd1"
        },
        {
            "title": "Jason Kelce slams fan's phone on ground (Different angle)",
            "selftext": "",
            "url": "https://v.redd.it/btnnckto4nyd1"
        },
        {
            "title": "Anna Haining Bates who, at 7'11'' was one of the tallest women in history. She had a husband, Martin Van Buren Bates, who was 7'8''.",
            "selftext": "",
            "url": "https://i.redd.it/ota39r82ynyd1.jpeg"
        },
        {
            "title": "Human Evolution ",
            "selftext": "",
            "url": "https://i.redd.it/fzpb8kloanyd1.jpeg"
        }
    ],
    "Damnthatsinteresting": [
        {
            "title": "Japanese snack law.",
            "selftext": "",
            "url": "https://v.redd.it/u8qf9z4uvoyd1"
        },
        {
            "title": "A train model carries a person on the back. A lot of power despite small size.",
            "selftext": "",
            "url": "https://v.redd.it/hymmujp2foyd1"
        },
        {
            "title": "Anna Haining Bates who, at 7'11'' was one of the tallest women in history. She had a husband, Martin Van Buren Bates, who was 7'8''.",
            "selftext": "",
            "url": "https://i.redd.it/r9z9pzr5woyd1.jpeg"
        },
        {
            "title": "Disinfection of cattle",
            "selftext": "",
            "url": "https://v.redd.it/qii1sbnionyd1"
        },
        {
            "title": "King of Spain pelted with mud in flood-hit Valencia Residents of flood-hit Valencia pelted King Felipe VI of Spain with mud as he arrived in the regions in the east of the country.",
            "selftext": "",
            "url": "https://v.redd.it/wiz40xnenpyd1"
        }
    ],
    "LivestreamFail": [
        {
            "title": "Asmon says that he has only seen evidence of Trump rigging things",
            "selftext": "",
            "url": "https://www.twitch.tv/zackrawrr/clip/OddRelatedPeppermintCmonBruh-I0trjpGK4NNfm7DS"
        },
        {
            "title": "Kick Owner Eddie has confirmed Fousey will be permanently banned from KICK",
            "selftext": "",
            "url": "https://kick.com/sam/clips/clip_01JBRB3ARQJ6PRS3N15ZQJ8YNM"
        },
        {
            "title": "Pokémon tcg winner wants to say something",
            "selftext": "",
            "url": "https://www.twitch.tv/pokemontcg/clip/SpunkyAmazonianOwlChefFrank-qbY5qmhGymkqIKqx?filter=clips&range=24hr&sort=time"
        },
        {
            "title": "There are \"hackers\" in Liar's Bar",
            "selftext": "",
            "url": "https://www.twitch.tv/laeppa/clip/ArtsyComfortableCardKappaRoss-W160qfJDYsC67jRI"
        }
    ],
    "pics": [
        {
            "title": "Helsinki 2018.  Trump insists on meeting with Putin with no other Americans allowed.",
            "selftext": "",
            "url": "https://i.redd.it/sc5c5e39hpyd1.jpeg"
        },
        {
            "title": "Meanwhile , here in Florida this morning …! ",
            "selftext": "",
            "url": "https://i.redd.it/372taybjqoyd1.jpeg"
        },
        {
            "title": "May 9, 2017, Trump fired FBI Director Comey to halt the Russia probe, telling Russians not to worry",
            "selftext": "",
            "url": "https://i.redd.it/klcbch7e9oyd1.jpeg"
        },
        {
            "title": "People wearing weird stuff in support of Trump",
            "selftext": "",
            "url": "https://www.reddit.com/gallery/1girz0m"
        }
    ],
    "Palworld": [
        {
            "title": "Lmao what",
            "selftext": "",
            "url": "https://v.redd.it/d1qirbumolyd1"
        },
        {
            "title": "Neighbor's Pals starving, so I had to do something",
            "selftext": "",
            "url": "https://v.redd.it/o3j2az1wanyd1"
        },
        {
            "title": "Direhowl is the main character",
            "selftext": "",
            "url": "https://i.redd.it/0da7mouhsnyd1.png"
        }
    ]
}